[
  {
    "title": "Design and Implementation of a Scalable, On-Premise Infrastructure for Large-Scale Data Gathering, Processing, and Storage in Machine Learning Applications",
    "secondTitle": "Návrh a implementace škálovatelné místní infrastruktury pro shromažďování, zpracování a ukládání dat ve velkém měřítku v aplikacích strojového učení",
    "folder": null,
    "description": "Design of a private computing environment for gathering and analyzing large collections of digital images with distributed storage and automated processing pipelines.",
    "language": "English",
    "date": "2026",
    "tags": ["Master Thesis"],
    "keywords": {
      "cs": [
        "Infrastruktura strojového učení",
        "Zpracování obrazu",
        "Distribuované ukládání dat",
        "Problém malých souborů",
        "Datové potrubí",
        "On-premise řešení",
        "Automatické škálování"
      ],
      "en": [
        "Machine learning infrastructure",
        "Image processing",
        "Distributed data storage",
        "Small file problem",
        "Data pipelines",
        "On-premise solutions",
        "Performance autoscaling"
      ]
    },
    "abstracts": {
      "cs": "Tato práce popisuje návrh soukromého výpočetního prostředí pro shromažďování a analýzu velkých sbírek digitálních obrazů. Systém řeší běžný problém s efektivitou, kdy správa milionů jednotlivých malých položek způsobuje zpomalení systémů kvůli administrativní zátěži. Díky volbě specializované metody ukládání, která uchovává informace o adresářích v rychlé paměti a seskupuje položky do větších balíčků, systém zajišťuje téměř okamžitý přístup k jakémukoliv souboru. Toto nastavení bylo vytvořeno na specializovaném fyzickém hardwaru, aby bylo možné plně kontrolovat soukromí dat a náklady a vyhnout se nutnosti veřejného internetového úložiště. Druhá část práce představuje automatizovaný zpracovatelský proces, který umožňuje transformaci dat, například výpočet obrazových reprezentací. Tento proces je navržen tak, aby byl vysoce dostupný a škálovatelný na základě pracovní zátěže. Díky použití automatizovaných škálovacích mechanismů systém aktivně přizpůsobuje své zdroje v závislosti na objemu příchozích úkolů, čímž udržuje vysokou propustnost během špiček a zároveň optimalizuje efektivitu při nízké zátěži.",
      "en": "This thesis describes the design of a private computing environment for gathering and analyzing large collections of digital images. The system solves a common efficiency problem where managing millions of individual small items causes systems to slow down due to administrative overhead. By choosing a specialized storage method that keeps the directory information in fast memory and groups items into larger packages, the system ensures nearly instant access to any single item. This setup was built on dedicated physical hardware to provide full control over data privacy and costs, avoiding the need for public internet-based storage. The second part of the thesis presents an automated processing pipeline that enables data transformation, such as computing image representations. This pipeline is designed to be highly available and scalable based on the workload. Through the use of automated scaling mechanisms, the system actively adjusts its resources in response to the volume of incoming tasks, maintaining high throughput during peak periods while optimizing efficiency when the load is low."
    },
    "links": [],
    "bibtex": null
  },
  {
    "title": "Síťová komunikace aplikací v Kubernetes s externími zařízeními v privátní síti",
    "secondTitle": "Network communication of Kubernetes applications with external devices in a private network",
    "folder": "batchelor-thesis/",
    "description": "Extending Kubernetes with TCP/UDP addressing of devices in adjacent private networks via a custom operator.",
    "language": "Czech",
    "date": "2023",
    "tags": ["Bachelor Thesis", "Awarded"],
    "keywords": {
      "cs": [
        "Kubernetes",
        "CNI",
        "network driver",
        "privátní síťový segment",
        "edge cloud computing",
        "Kubernetes operátor",
        "síťování",
        "TCP",
        "UDP",
        "K8S"
      ],
      "en": [
        "Kubernetes",
        "CNI",
        "network driver",
        "private network segment",
        "edge cloud computing",
        "Kubernetes operator",
        "networking",
        "TCP",
        "UDP",
        "K8S"
      ]
    },
    "abstracts": {
      "cs": "Tato práce se zabývá možnostmi síťování v systému Kubernetes. Cílem práce bylo rozšířit Kubernetes o možnost adresace a komunikace cloudu se zařízeními v privátních sítích. Známá řešení poskytují pouze komunikaci pomocí vysokoúrovňových protokolů. Cílem bylo nalézt řešení, které by podporovalo protokoly nižších vrstev ISO/OSI. Práce představuje možnost rozšíření systému Kubernetes o zmíněnou funkcionality síťové komunikace. Tento způsob umožňuje komunikaci pomocí TCP a UDP protokolů se zařízeními v privátních sítích. Představené řešení nabízí flexibilitu použití a nepředstavuje žádná omezení pro standardní použití systému Kubernetes. Řešení je realizováno pomocí zavedených standardů pro rozšiřování systému. Výsledky této práce poskytují širší možnosti pro použití systému Kubernetes. Díky tomuto rozšíření je možné lépe využít systém Kubernetes v oblastech testování, smart cities a dalších oblastech pracujících se zařízeními v privátních sítích.",
      "en": "This thesis explores the networking capabilities of Kubernetes. The aim of the thesis was to extend Kubernetes with the possibility of addressing and communicating with devices in private networks. Known solutions only provide communication using high-level protocols. The goal was to find a solution that would support communication using lower layer ISO/OSI protocols. This thesis presents the possibility of extending the kubernetes system with the mentioned functionalities of network communication. This method allows communication with devices in private networks using TCP and UDP protocols. The presented solution offers flexibility of use and does not present any limitation restricting standard use of Kubernetes. The solution is implemented using established standards for extending the system. The results of this work provide wider possibilities for the use of Kubernetes. With this extension, it is possible to make better use of Kubernetes in the areas of testing, smart cities and other areas working with devices in private networks."
    },
    "links": [
      {
        "label": "DSpace",
        "url": "https://dspace.cvut.cz/entities/publication/5e7bcab8-8695-4f67-bdb6-fe75976b5201"
      }
    ],
    "bibtex": "@thesis{trojak_network_2023,\n    title     = {Network communication of Kubernetes applications\n                 with external devices in a private network},\n    url       = {https://dspace.cvut.cz/entities/publication/5e7bcab8-8695-4f67-bdb6-fe75976b5201},\n    institution = {Czech Technical University in Prague},\n    author    = {Troják, Jan},\n    date      = {2023-06-16},\n}"
  },
  {
    "title": "Distributed Block and Object Storage",
    "folder": "distributed-storage-solutions/",
    "description": "Survey of storage solutions (block, file-system, object) and distributed storage architectures: replication, erasure coding, scalability.",
    "language": "English",
    "date": "2025",
    "tags": [],
    "abstracts": {
      "en": "This document explores the evolution and categorization of storage solutions, focusing on the shift from traditional systems to modern distributed storage architectures. It highlights key types of storage—block storage, file systems, and object storage—and their respective use cases, advantages, and challenges. The need for distributed storage is addressed through scalability, fault tolerance, and performance considerations, with emphasis on architectural concepts like storage pools, replication, erasure coding, and scalability strategies. The paper also provides an overview of practical implementations, offering insights into the design and functionality of modern storage systems."
    },
    "links": [
      {
        "label": "PDF",
        "url": "https://pub.zezav.cz/files/distributed-storage.pdf"
      }
    ],
    "bibtex": "@misc{trojak_distributed_2025,\n    title     = {Distributed block and object storage},\n    url       = {https://pub.zezav.cz/files/distributed-storage.pdf},\n    publisher = {Faculty of Information Technology, CTU},\n    author    = {Troják, Jan},\n    date      = {2025-01-30},\n}"
  },
  {
    "title": "As-Far-As-Possible LE Algorithm Implementation",
    "folder": "as-far-as-possible-le/",
    "description": "Implementation and evaluation of the As-Far-As-Possible leader election algorithm in distributed systems using gRPC. NI-DSV course assignment.",
    "language": "English",
    "date": "2024",
    "tags": [],
    "links": [
      {
        "label": "PDF",
        "url": "https://pub.zezav.cz/files/afap-le.pdf"
      }
    ],
    "bibtex": "@misc{trojak_as-far-as-possible_2024,\n    title     = {As-Far-As-Possible LE Algorithm Implementation},\n    url       = {https://pub.zezav.cz/files/afap-le.pdf},\n    publisher = {Faculty of Information Technology, CTU},\n    author    = {Troják, Jan},\n    date      = {2024-12-26},\n}"
  },
  {
    "title": "NI-MCC: Merge Sort",
    "folder": "marge-sort/",
    "description": "Semester project on sequential and parallel (multi-core) merge sort implementations with benchmarking and analysis.",
    "language": "Czech",
    "date": "2024",
    "tags": [],
    "links": [
      {
        "label": "PDF",
        "url": "https://pub.zezav.cz/files/merge-sort.pdf"
      }
    ],
    "bibtex": "@misc{trojak_merge_2024,\n    title  = {Merge sort},\n    url    = {https://pub.zezav.cz/files/merge-sort.pdf},\n    author = {Troják, Jan},\n    date   = {2024-03-12},\n}"
  },
  {
    "title": "Moucha.org migrace na SD-WAN a SD-Access",
    "secondTitle": "Moucha.org migration to SD-WAN and SD-Access",
    "folder": "sdn-migration/",
    "description": "Proposal for migrating moucha.org network infrastructure from traditional networking to SDN (SD-WAN, SD-Access).",
    "language": "Czech",
    "date": "2024",
    "tags": [],
    "links": [
      {
        "label": "PDF",
        "url": "https://pub.zezav.cz/files/sdn-migration.pdf"
      }
    ],
    "bibtex": "@misc{trojak_mouchaorg_2024,\n    title  = {Moucha.org migrace na SD-WAN a SD-Access},\n    url    = {https://pub.zezav.cz/files/sdn-migration.pdf},\n    author = {Troják, Jan},\n    date   = {2024-01-14},\n}"
  },
  {
    "title": "NI-GPU: Merge Sort & Bitonic Sort on GPU",
    "folder": "NI-GPU/",
    "description": "CUDA implementations of merge sort and bitonic sort with CPU vs GPU performance comparison.",
    "language": "Czech",
    "date": "2024",
    "tags": [],
    "links": [],
    "bibtex": null
  },
  {
    "title": "NI-PDP: Výměna jezdců na šachovnici",
    "secondTitle": "NI-PDP: Knight swap on a chessboard",
    "folder": "NI-PDP/",
    "description": "Parallelized knight-swap problem on a chessboard with multiple parallelization strategies.",
    "language": "Czech",
    "date": "2024",
    "tags": [],
    "links": [],
    "bibtex": null
  },
  {
    "title": "Normalita a její vnímání",
    "secondTitle": "Normality and its perception",
    "folder": "normality/",
    "description": "Reflective essay on the variability and relativity of cultural norms and normality perception.",
    "language": "Czech",
    "date": "2024",
    "tags": [],
    "links": [
      {
        "label": "PDF",
        "url": "https://pub.zezav.cz/files/normality.pdf"
      }
    ],
    "bibtex": "@misc{trojak_normalita_2024,\n    title  = {Normalita a její vnímání},\n    url    = {https://pub.zezav.cz/files/normality.pdf},\n    author = {Troják, Jan},\n    date   = {2024-02-11},\n}"
  },
  {
    "title": "Windows Reverse RDP Attack (CVE-2019-0887)",
    "folder": "windows-reverse-rdp-attack/",
    "description": "Beamer presentation on the CVE-2019-0887 reverse RDP vulnerability. BI-SSB course project.",
    "language": "Czech",
    "date": "2021",
    "tags": ["Presentation"],
    "links": [
      {
        "label": "PDF",
        "url": "https://pub.zezav.cz/files/windows-reverse-rdp-attack.pdf"
      }
    ],
    "bibtex": null
  },
  {
    "title": "Webová aplikace pro odevzdávání pracovních výkazů",
    "secondTitle": "Web application for submitting work reports",
    "folder": "worker-site/",
    "description": "Report on a Django-based web application for submitting and managing work time-sheets. BI-PYT semester project.",
    "language": "Czech",
    "date": "2022",
    "tags": [],
    "links": [
      {
        "label": "PDF",
        "url": "https://pub.zezav.cz/files/worker-site.pdf"
      }
    ],
    "bibtex": null
  }
]
